{
    "C/C++": "C++ is my main programming language. I started studying and using it during my time at DMU. I used the language in various projects, including my dissertation. While relatively novice in the C programming language, I did use it as part of my university education for the creation of embedded systems.",
    "JavaScript": "Javascript is a relatively new skill, having picked it up slightly before joining IBM. However, once I joined I began developing my skills greatly in projects, both professional and personal.",
    "Java": "While never using Java in a professional project, I took great interest in the language due to its syntactical similarities to C++. I have used the Swing library previously to easily create user interfaces that provide an easy way to provide input for applications written in other programming languages.",
    "Python": "Python appealed to me greatly as a language due to its wide use in artifical intelligence and machine learning. While having used Python for personal projects, my main ambition with the language is to learn frameworks such as TensorFlow and PyTorch. Previously, I have used python to create user interfaces, and as a prototyping tool in robotics projects.",
    "AWS": "I have been using AWS since July 2020, when I started my new job as a DevOps consultant. Since then, I have moved to a new career in development but still made use of AWS for projects. In addition, I completed my AWS Certified Cloud Practitioner exam.",
    "HTML": "While web development is not one of my major passions, I do enjoy using HTML and CSS in personal projects, such as this website.",
    "Linux": "Since beginning university, Linux has been my daily driver operating system, having used it for both personal computing and as a server, not relying on graphical user interfaces (GUIs).",
    "Docker": "I have used Docker since July 2020 as a DevOps consultant. Making use of containerisation technology for my personal projects, allowing others to use my programs on their systems with ease, not needing to install any dependencies.",
    "Kubernetes": "In conjuntion with docker, I have used kubernetes to orchestrate my containerised programs. Using Kubernetes I spread a system across multiple servers, ensuring constant accessibility and scalability.",
    "Bash": "Writing scripts in bash and powershell allowed me to begin automating my personal computer, removing the need to run basic commands multiple times. Instead, the system was automated to run these commands in the background, allowing me to focus on other things in the meantime.",
    "SQL": "In both my time as a DevOps consultant and developer, SQL has been constantly required to access information from databases.",
    "ROS": "Standing for 'Robot Operating System', ROS was a large portion of my dissertation and began my interest in autonomous robotics. Using this meta-operating system, I created a self-navigating robot that could autonomously navigate an area while creating a map of the environment for future use.",
    "Jenkins": "I used jenkins to create pipelines, automating the tasks required to add and run software to remote servers. The pipelines were made up of secrets and shell scripts that would retrieve, test and deploy applications on a number of servers with no input required from the user.",
    "Terraform": "I used terraform to create and configure AWS systems automatically, ensuring that they're set up in a correct fashion for the application to be desployed correctly.",
    "React": "At my time with IBM, I utilised the React framework to create web apps, and have since continued my education of the framework.",
    "Vue":"I used Vue.js as the framework for my first major project at IBM, using it to create expansive web applications tailored for the needs of the client.",
    "VB": "I have made use of Visual Basic since my time at college, and have since used it on a project while working with IBM. I have utilised the language to create user interfaces and enable communication between several other applications."
}